_blog/altmetrics-api.org
* Altmetric API

Altmetric provides an [[http://api.altmetric.com][API]] to access data about the things they monitor.


I am most interested in the DOI API: http://api.altmetric.com/docs/call_doi.html

Here is an example of retrieving some data for doi:10.1007/s00799-016-0173-7. Note that not all data is available in the json you get back, e.g. if there are no google plus counts, it is not listed in the json data.

#+BEGIN_SRC python :results output org drawer
import pprint
import requests

pp = pprint.PrettyPrinter()

req = requests.get('http://api.altmetric.com/v1/doi/10.1007/s00799-016-0173-7')
pp.pprint(req.json())
#+END_SRC

#+RESULTS:
:RESULTS:
{'added_on': 1465911575,
 'altmetric_id': 8729145,
 'altmetric_jid': '4f6fa4ed3cf058f610002bbc',
 'cited_by_accounts_count': 2,
 'cited_by_posts_count': 2,
 'cited_by_tweeters_count': 2,
 'cohorts': {'pub': 1, 'sci': 1},
 'context': {'all': {'count': 5357011,
                     'higher_than': 2698315,
                     'mean': 6.2704072827961,
                     'pct': 50,
                     'rank': 2606877},
             'journal': {'count': 100,
                         'higher_than': 32,
                         'mean': 6.2053131313131,
                         'pct': 32,
                         'rank': 68},
             'similar_age_3m': {'count': 171806,
                                'higher_than': 92303,
                                'mean': 10.720463048223,
                                'pct': 53,
                                'rank': 77157},
             'similar_age_journal_3m': {'count': 7,
                                        'higher_than': 1,
                                        'mean': 10.268333333333,
                                        'pct': 14,
                                        'rank': 6}},
 'details_url': 'http://www.altmetric.com/details.php?citation_id=8729145',
 'doi': '10.1007/s00799-016-0173-7',
 'history': {'1d': 0,
             '1m': 0,
             '1w': 0,
             '1y': 1.35,
             '2d': 0,
             '3d': 0,
             '3m': 1.35,
             '4d': 0,
             '5d': 0,
             '6d': 0,
             '6m': 1.35,
             'at': 1.35},
 'images': {'large': 'https://altmetric-badges.a.ssl.fastly.net/?size=180&score=2&types=tttttttt',
            'medium': 'https://altmetric-badges.a.ssl.fastly.net/?size=100&score=2&types=tttttttt',
            'small': 'https://altmetric-badges.a.ssl.fastly.net/?size=64&score=2&types=tttttttt'},
 'is_oa': False,
 'issns': ['1432-1300'],
 'journal': 'International Journal on Digital Libraries',
 'last_updated': 1465914231,
 'published_on': 1465603200,
 'publisher_subjects': [{'name': 'Library And Information Studies',
                         'scheme': 'era'},
                        {'name': 'Computer Science', 'scheme': 'springer'},
                        {'name': 'Database Management', 'scheme': 'springer'},
                        {'name': 'Information Systems and Communication '
                                 'Service',
                         'scheme': 'springer'}],
 'readers': {'citeulike': '0', 'connotea': '0', 'mendeley': '2'},
 'readers_count': 2,
 'schema': '1.5.4',
 'scopus_subjects': ['Social Sciences'],
 'score': 1.35,
 'title': 'Automating data sharing through authoring tools',
 'type': 'article',
 'url': 'http://dx.doi.org/10.1007/s00799-016-0173-7'}
:END:

From that data, we can extract quite a bit of useful information.

#+BEGIN_SRC python :results output org drawer
import json
import requests

req = requests.get('http://api.altmetric.com/v1/doi/10.1007/s00799-016-0173-7')
j = req.json()

print(j.get('cited_by_tweeters_count', 0))
print(j.get('cited_by_fbwalls_count', 0))  # facebook
print(j.get('cited_by_msm_count', 0))  # news I think
print(j.get('cited_by_feeds_count', 0))  # blogs I think
print(j.get('cited_by_posts_count', 0))  # blogs I think
print(j.get('cited_by_gplus_count', 0))  # Google+
print(j['is_oa'])  # open access
print(j['score'])  # Attention score
print(j['cohorts']['pub'])  # public
print(j['cohorts']['sci'])  # scientists
print(j['readers'])
print(j['url'])
print(j['details_url'])

print(j['context']['all']['pct'])  # All outputs
print(j['context']['journal']['pct'])
print(j['context']['similar_age_3m']['pct'])  # compared to similar age
print(j['context']['similar_age_journal_3m']['pct'])  # similar age and journal
#+END_SRC

#+RESULTS:
:RESULTS:
2
0
0
0
2
0
False
1.35
1
1
{'mendeley': '2', 'connotea': '0', 'citeulike': '0'}
http://dx.doi.org/10.1007/s00799-016-0173-7
http://www.altmetric.com/details.php?citation_id=8729145
50
32
53
14
:END:



