_blog/altmetrics-api.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-12-30 Fri 11:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="John Kitchin" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5054140">1. Altmetric API</a>
<ul>
<li><a href="#org0e8a079">1.1. Paper by Meagan Mauter</a></li>
<li><a href="#org8698b78">1.2. Gellman N Chem paper</a></li>
<li><a href="#org85af20f">1.3. An example with no mentions</a></li>
<li><a href="#orgdff2928">1.4. orcid</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org5054140" class="outline-2">
<h2 id="org5054140"><span class="section-number-2">1</span> Altmetric API</h2>
<div class="outline-text-2" id="text-1">
<p>
<div id="api">
Altmetric provides an <a href="http://api.altmetric.com">API</a> to access data about the things they monitor.
</p>


<p>
I am most interested in the DOI API: <a href="http://api.altmetric.com/docs/call_doi.html">http://api.altmetric.com/docs/call_doi.html</a>
</p>

<p>
Here is an example of retrieving some data for <a href="https://doi.org/10.1007/s00799-016-0173-7">doi:10.1007/s00799-016-0173-7</a>. Note that not all data is available in the json you get back, e.g. if there are no google plus counts, it is not listed in the json data.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">import</span> pprint
<span style="color: #0000FF;">import</span> requests

<span style="color: #BA36A5;">pp</span> = pprint.PrettyPrinter()

<span style="color: #BA36A5;">req</span> = requests.get(<span style="color: #008000;">'http://api.altmetric.com/v1/doi/10.1007/s00799-016-0173-7'</span>)
pp.pprint(req.json())
</pre>
</div>

<p>
{'added_on': 1465911575,
 'altmetric_id': 8729145,
 'altmetric_jid': '4f6fa4ed3cf058f610002bbc',
 'cited_by_accounts_count': 2,
 'cited_by_posts_count': 2,
 'cited_by_tweeters_count': 2,
 'cohorts': {'pub': 1, 'sci': 1},
 'context': {'all': {'count': 5357011,
                     'higher_than': 2698315,
                     'mean': 6.2704072827961,
                     'pct': 50,
                     'rank': 2606877},
             'journal': {'count': 100,
                         'higher_than': 32,
                         'mean': 6.2053131313131,
                         'pct': 32,
                         'rank': 68},
             'similar_age_3m': {'count': 171806,
                                'higher_than': 92303,
                                'mean': 10.720463048223,
                                'pct': 53,
                                'rank': 77157},
             'similar_age_journal_3m': {'count': 7,
                                        'higher_than': 1,
                                        'mean': 10.268333333333,
                                        'pct': 14,
                                        'rank': 6}},
 'details_url': 'http://www.altmetric.com/details.php?citation_id=8729145',
 'doi': '10.1007/s00799-016-0173-7',
 'history': {'1d': 0,
             '1m': 0,
             '1w': 0,
             '1y': 1.35,
             '2d': 0,
             '3d': 0,
             '3m': 1.35,
             '4d': 0,
             '5d': 0,
             '6d': 0,
             '6m': 1.35,
             'at': 1.35},
 'images': {'large': 'https://altmetric-badges.a.ssl.fastly.net/?size=180&amp;score=2&amp;types=tttttttt',
            'medium': 'https://altmetric-badges.a.ssl.fastly.net/?size=100&amp;score=2&amp;types=tttttttt',
            'small': 'https://altmetric-badges.a.ssl.fastly.net/?size=64&amp;score=2&amp;types=tttttttt'},
 'is_oa': False,
 'issns': ['1432-1300'],
 'journal': 'International Journal on Digital Libraries',
 'last_updated': 1465914231,
 'published_on': 1465603200,
 'publisher_subjects': [{'name': 'Library And Information Studies',
                         'scheme': 'era'},
                        {'name': 'Computer Science', 'scheme': 'springer'},
                        {'name': 'Database Management', 'scheme': 'springer'},
                        {'name': 'Information Systems and Communication '
                                 'Service',
                         'scheme': 'springer'}],
 'readers': {'citeulike': '0', 'connotea': '0', 'mendeley': '2'},
 'readers_count': 2,
 'schema': '1.5.4',
 'scopus_subjects': ['Social Sciences'],
 'score': 1.35,
 'title': 'Automating data sharing through authoring tools',
 'type': 'article',
 'url': 'http://dx.doi.org/10.1007/s00799-016-0173-7'}
</p>

<p>
From that data, we can extract quite a bit of useful information.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">import</span> json
<span style="color: #0000FF;">import</span> requests

<span style="color: #BA36A5;">req</span> = requests.get(<span style="color: #008000;">'http://api.altmetric.com/v1/doi/10.1007/s00799-016-0173-7'</span>)
<span style="color: #BA36A5;">j</span> = req.json()

<span style="color: #0000FF;">print</span>(j.get(<span style="color: #008000;">'cited_by_tweeters_count'</span>, 0))
<span style="color: #0000FF;">print</span>(j.get(<span style="color: #008000;">'cited_by_fbwalls_count'</span>, 0))  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">facebook</span>
<span style="color: #0000FF;">print</span>(j.get(<span style="color: #008000;">'cited_by_msm_count'</span>, 0))  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">news I think</span>
<span style="color: #0000FF;">print</span>(j.get(<span style="color: #008000;">'cited_by_feeds_count'</span>, 0))  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">blogs I think</span>
<span style="color: #0000FF;">print</span>(j.get(<span style="color: #008000;">'cited_by_posts_count'</span>, 0))  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">blogs I think</span>
<span style="color: #0000FF;">print</span>(j.get(<span style="color: #008000;">'cited_by_gplus_count'</span>, 0))  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Google+</span>
<span style="color: #0000FF;">print</span>(j[<span style="color: #008000;">'is_oa'</span>])  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">open access</span>
<span style="color: #0000FF;">print</span>(j[<span style="color: #008000;">'score'</span>])  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Attention score</span>
<span style="color: #0000FF;">print</span>(j[<span style="color: #008000;">'cohorts'</span>][<span style="color: #008000;">'pub'</span>])  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">public</span>
<span style="color: #0000FF;">print</span>(j[<span style="color: #008000;">'cohorts'</span>][<span style="color: #008000;">'sci'</span>])  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">scientists</span>
<span style="color: #0000FF;">print</span>(j[<span style="color: #008000;">'readers'</span>])
<span style="color: #0000FF;">print</span>(j[<span style="color: #008000;">'url'</span>])
<span style="color: #0000FF;">print</span>(j[<span style="color: #008000;">'details_url'</span>])

<span style="color: #0000FF;">print</span>(j[<span style="color: #008000;">'context'</span>][<span style="color: #008000;">'all'</span>][<span style="color: #008000;">'pct'</span>])  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">All outputs</span>
<span style="color: #0000FF;">print</span>(j[<span style="color: #008000;">'context'</span>][<span style="color: #008000;">'journal'</span>][<span style="color: #008000;">'pct'</span>])
<span style="color: #0000FF;">print</span>(j[<span style="color: #008000;">'context'</span>][<span style="color: #008000;">'similar_age_3m'</span>][<span style="color: #008000;">'pct'</span>])  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">compared to similar age</span>
<span style="color: #0000FF;">print</span>(j[<span style="color: #008000;">'context'</span>][<span style="color: #008000;">'similar_age_journal_3m'</span>][<span style="color: #008000;">'pct'</span>])  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">similar age and journal</span>
</pre>
</div>

<p>
2
0
0
0
2
0
False
1.35
1
1
{'mendeley': '2', 'connotea': '0', 'citeulike': '0'}
<a href="https://doi.org/10.1007/s00799-016-0173-7">https://doi.org/10.1007/s00799-016-0173-7</a>
<a href="http://www.altmetric.com/details.php?citation_id=8729145">http://www.altmetric.com/details.php?citation_id=8729145</a>
50
32
53
14
</p>
</div>
