_blog/altmetrics-api.org
** Paper by Meagan Mauter
#+BEGIN_SRC python :results output org drawer
import pprint
import requests

pp = pprint.PrettyPrinter()

req = requests.get('http://api.altmetric.com/v1/doi/10.1021/es5060989')
pp.pprint(req.json())
#+END_SRC

#+RESULTS:
:RESULTS:
{'abstract': 'Secondary application of unconverted heat produced during '
             'electric power generation has the potential to improve the '
             'life-cycle fuel efficiency of the electric power industry and '
             'the sectors it serves. This work quantifies the residual heat '
             '(also known as waste heat) generated by U.S. thermal power '
             'plants and assesses the intermittency and transport issues that '
             'must be considered when planning to utilize this heat. Combining '
             'Energy Information Administration plant-level data with '
             'literature-reported process efficiency data, we develop '
             'estimates of the unconverted heat flux from individual U.S. '
             'thermal power plants in 2012. Together these power plants '
             'discharged an estimated 18.9 billion GJth of residual heat in '
             '2012, 4% of which was discharged at temperatures greater than 90 '
             '°C. We also characterize the temperature, spatial distribution, '
             'and temporal availability of this residual heat at the plant '
             'level and model the implications for the technical and economic '
             'feasibility of its end use. Increased implementation of flue gas '
             'desulfurization technologies at coal-fired facilities and the '
             'higher quality heat generated in the exhaust of natural gas fuel '
             'cycles are expected to increase the availability of residual '
             'heat generated by 10.6% in 2040.',
 'added_on': 1434777401,
 'altmetric_id': 4191302,
 'altmetric_jid': '4f6fa4eb3cf058f6100027ef',
 'cited_by_accounts_count': 5,
 'cited_by_fbwalls_count': 1,
 'cited_by_gplus_count': 1,
 'cited_by_posts_count': 5,
 'cited_by_tweeters_count': 3,
 'cohorts': {'pub': 1, 'sci': 2},
 'context': {'all': {'count': 4785528,
                     'higher_than': 2984447,
                     'mean': 5.72647012043,
                     'pct': 62,
                     'rank': 1783986},
             'journal': {'count': 4919,
                         'higher_than': 2678,
                         'mean': 9.1540976006507,
                         'pct': 54,
                         'rank': 2224},
             'similar_age_3m': {'count': 173023,
                                'higher_than': 112932,
                                'mean': 8.4118428754727,
                                'pct': 65,
                                'rank': 59051},
             'similar_age_journal_3m': {'count': 122,
                                        'higher_than': 73,
                                        'mean': 8.8715371900826,
                                        'pct': 59,
                                        'rank': 49}},
 'details_url': 'http://www.altmetric.com/details.php?citation_id=4191302',
 'doi': '10.1021/es5060989',
 'history': {'1d': 0,
             '1m': 0,
             '1w': 0,
             '1y': 2.75,
             '2d': 0,
             '3d': 0,
             '3m': 0,
             '4d': 0,
             '5d': 0,
             '6d': 0,
             '6m': 0,
             'at': 2.75},
 'images': {'large': 'https://altmetric-badges.a.ssl.fastly.net/?size=180&score=3&types=tttttffg',
            'medium': 'https://altmetric-badges.a.ssl.fastly.net/?size=100&score=3&types=tttttffg',
            'small': 'https://altmetric-badges.a.ssl.fastly.net/?size=64&score=3&types=tttttffg'},
 'is_oa': False,
 'issns': ['1520-5851'],
 'journal': 'Environmental Science & Technology',
 'last_updated': 1440430714,
 'pmid': '26061407',
 'publisher_subjects': [{'name': 'Multidisciplinary', 'scheme': 'era'}],
 'readers': {'citeulike': '0', 'connotea': '0', 'mendeley': '13'},
 'readers_count': 13,
 'schema': '1.5.4',
 'scopus_subjects': ['Chemistry', 'Environmental Science', 'Physical Sciences'],
 'score': 2.75,
 'subjects': ['environmentalhealth'],
 'title': 'Quantity, Quality, and Availability of Waste Heat from United '
          'States Thermal Power Generation',
 'tq': ['Quantity, quality, and availability of waste heat from U.S. thermal '
        '#power generation,',
        'Technoeconomically feasible transport distance of residual heat from '
        'US Thermal e Generation'],
 'type': 'article',
 'url': 'http://dx.doi.org/10.1021/es5060989'}
:END:

