_blog/altmetrics-api.org
** Gellman N Chem paper

#+BEGIN_SRC python :results output org drawer
import pprint
import requests

pp = pprint.PrettyPrinter()

req = requests.get('http://api.altmetric.com/v1/doi/10.1038/nchem.2250')
pp.pprint(req.json())
#+END_SRC

#+RESULTS:
:RESULTS:
{'abstract': 'The homochirality of biomolecules is a signature of life on '
             'Earth and has significant implications in, for example, the '
             'production of pharmaceutical compounds. It has been suggested '
             'that biomolecular homochirality may have arisen from the '
             'amplification of a spontaneously formed small enantiomeric '
             'excess (e.e.). Many minerals exhibit naturally chiral surfaces '
             'and so adsorption has been proposed as one possible mechanism '
             'for such an amplification of e.e. Here we show that when '
             'gas-phase mixtures of D- and L-aspartic acid are exposed to an '
             'achiral Cu(111) surface, a small e.e. in the gas phase, e.e.g, '
             'leads to an amplification of the e.e. on the surface, e.e.s, '
             'under equilibrium conditions. Adsorption-induced amplification '
             'of e.e. does not require a chiral surface. The dependence of '
             'e.e.s on e.e.g has been modelled successfully using a '
             'Langmuir-like adsorption isotherm that incorporates the '
             'formation of homochiral adsorbate clusters on the surface.',
 'added_on': 1430845955,
 'altmetric_id': 3969782,
 'altmetric_jid': '4f6fa52f3cf058f610004265',
 'cited_by_accounts_count': 22,
 'cited_by_fbwalls_count': 1,
 'cited_by_feeds_count': 1,
 'cited_by_msm_count': 2,
 'cited_by_posts_count': 23,
 'cited_by_tweeters_count': 18,
 'cohorts': {'doc': 1, 'pub': 8, 'sci': 9},
 'context': {'all': {'count': 5310772,
                     'higher_than': 5155818,
                     'mean': 6.2319383445464,
                     'pct': 97,
                     'rank': 154865},
             'journal': {'count': 1418,
                         'higher_than': 1164,
                         'mean': 22.292201834862,
                         'pct': 82,
                         'rank': 254},
             'similar_age_3m': {'count': 161999,
                                'higher_than': 153551,
                                'mean': 9.5255127841085,
                                'pct': 94,
                                'rank': 8443},
             'similar_age_journal_3m': {'count': 65,
                                        'higher_than': 47,
                                        'mean': 24.013,
                                        'pct': 72,
                                        'rank': 18}},
 'details_url': 'http://www.altmetric.com/details.php?citation_id=3969782',
 'doi': '10.1038/nchem.2250',
 'history': {'1d': 0,
             '1m': 0,
             '1w': 0,
             '1y': 0.5,
             '2d': 0,
             '3d': 0,
             '3m': 0,
             '4d': 0,
             '5d': 0,
             '6d': 0,
             '6m': 0,
             'at': 33.55},
 'images': {'large': 'https://altmetric-badges.a.ssl.fastly.net/?size=180&score=34&types=mbtttttf',
            'medium': 'https://altmetric-badges.a.ssl.fastly.net/?size=100&score=34&types=mbtttttf',
            'small': 'https://altmetric-badges.a.ssl.fastly.net/?size=64&score=34&types=mbtttttf'},
 'is_oa': False,
 'issns': ['1755-4349'],
 'journal': 'Nature Chemistry',
 'last_updated': 1451923092,
 'pmid': '25991532',
 'published_on': 1430697600,
 'publisher_subjects': [{'name': 'Surface chemistry', 'scheme': 'npg'},
                        {'name': 'Chemical Sciences', 'scheme': 'era'}],
 'readers': {'citeulike': '0', 'connotea': '0', 'mendeley': '29'},
 'readers_count': 29,
 'schema': '1.5.4',
 'scopus_subjects': ['Chemistry', 'Chemical Engineering', 'Physical Sciences'],
 'score': 33.55,
 'subjects': ['chemistry'],
 'title': 'Adsorption-induced auto-amplification of enantiomeric excess on an '
          'achiral surface',
 'tq': ['Enantioenrichment of chiral molecules through adsorption on an '
        'achiral surface',
        'Very cool Nat Chem paper by Prof. Gellman of',
        '@NatureChemistry:Enantioenrichment of chiral molecules through '
        'adsorption on achiral surface'],
 'type': 'article',
 'url': 'http://dx.doi.org/10.1038/nchem.2250'}
:END:


#+BEGIN_SRC python :results output org drawer
import pprint
import requests

pp = pprint.PrettyPrinter()

req = requests.get('http://api.altmetric.com/v1/doi/10.1038/nchem.2250')
j = req.json()

print(j['context']['all']['pct'])  # All outputs
print(j['context']['journal']['pct'])
print(j['context']['similar_age_3m']['pct'])  # compared to similar age
print(j['context']['similar_age_journal_3m']['pct'])  # similar age and journal
#+END_SRC

#+RESULTS:
:RESULTS:
97
82
94
72
:END:

** An example with no mentions
#+BEGIN_SRC python :results output org drawer
import pprint
import requests

pp = pprint.PrettyPrinter()

req = requests.get('http://api.altmetric.com/v1/doi/10.1016/j.jcis.2015.08.055')
print(req.status_code)
#+END_SRC

#+RESULTS:
:RESULTS:
404
:END:


