_blog/altmetrics-api.org
** orcid

#+BEGIN_SRC python :results value
import requests
import json

resp = requests.get("http://pub.orcid.org/0000-0003-2625-9232/orcid-works",
                    headers={'Accept':'application/orcid+json'})

results = resp.json()

DOIS = []
for i, result in enumerate(results['orcid-profile']['orcid-activities']
                           ['orcid-works']['orcid-work']):
    ext_ids = result['work-external-identifiers']['work-external-identifier']
    for eid in ext_ids:
        
        if eid['work-external-identifier-type'] == 'DOI':
            doi = eid['work-external-identifier-id']['value']
        else:
            doi = None

        DOIS += [[doi]]

return DOIS
#+END_SRC

#+RESULTS:
| 10.1016/j.susc.2015.10.001                       |
| 10.1016/j.susc.2015.05.007                       |
| 10.1063/1.4916823                                |
| 10.1063/1.4914093                                |
| 10.1021/jp511426q                                |
| 10.1063/1.4914093                                |
| 10.1016/j.susc.2015.02.011                       |
| 10.1063/1.4914093                                |
| None                                             |
| 10.1021/cs501585k                                |
| None                                             |
| 10.1016/j.susc.2015.02.011                       |
| None                                             |
| 10.1021/jp511426q                                |
| None                                             |
| 10.1021/jp508805h                                |
| 10.1016/j.catcom.2013.10.028                     |
| 10.1016/j.catcom.2013.10.028                     |
| 10.1021/ja5015986                                |
| 10.1021/am4059149                                |
| 10.1007/s11244-013-0166-3                        |
| None                                             |
| 10.1016/j.catcom.2013.10.028                     |
| None                                             |
| 10.1039/c3ra47097k                               |
| None                                             |
| 10.1039/c3ra47097k                               |
| 10.1021/jp508805h                                |
| None                                             |
| 10.1021/am4059149                                |
| None                                             |
| 10.1021/ja5015986                                |
| None                                             |
| 10.1021/jp507957n                                |
| None                                             |
| 10.1021/jp507957n                                |
| 10.1007/s11244-013-0166-3                        |
| 10.1021/ie400582a                                |
| None                                             |
| None                                             |
| [[http://dx.doi.org/10.1016/j.molstruc.2013.01.046]] |
| 10.1021/ie400582a                                |
| None                                             |
| None                                             |
| [[http://dx.doi.org/10.1016/j.ijggc.2013.06.020]]    |
| 10.1021/ie301419q                                |
| 10.1021/cs3002644                                |
| 10.2172/1149701                                  |
| None                                             |
| None                                             |
| 10.1016/j.pecs.2012.03.003                       |
| None                                             |
| 10.1111/j.1551-2916.2012.05236.x                 |
| None                                             |
| 10.1111/j.1551-2916.2012.05236.x                 |
| None                                             |
| 10.1021/cs3002644                                |
| None                                             |
| 10.1007/s11244-012-9808-0                        |
| None                                             |
| 10.1007/s11244-012-9808-0                        |
| None                                             |
| None                                             |
| None                                             |
| 10.1021/ie300452c                                |
| 10.1021/ie300452c                                |
| None                                             |
| None                                             |
| 10.1063/1.4746117                                |
| None                                             |
| 10.1063/1.4746117                                |
| 10.1039/9781849734776-00083                      |
| None                                             |
| 10.1039/9781849734776-00083                      |
| None                                             |
| 10.1021/ie301419q                                |
| None                                             |
| None                                             |
| None                                             |
| 10.1002/cctc.201000397                           |
| None                                             |
| 10.1002/cctc.201000397                           |
| None                                             |
| None                                             |
| 10.1149/1.3570235                                |
| None                                             |
| 10.1021/cs200039t                                |
| None                                             |
| 10.1021/cs200039t                                |
| None                                             |
| 10.1063/1.3631948                                |
| None                                             |
| 10.1063/1.3631948                                |
| None                                             |
| 10.1063/1.3561287                                |
| None                                             |
| 10.1063/1.3561287                                |
| None                                             |
| 10.1002/cssc.201000056                           |
| 10.1016/j.fuel.2009.11.036                       |
| 10.1080/08927022.2010.481794                     |
| 045414\n10.1103/PhysRevB.82.045414               |
| None                                             |
| 10.1016/j.fuel.2009.11.036                       |
| None                                             |
| 10.1080/08927022.2010.481794                     |
| None                                             |
| None                                             |
| 10.1149/1.3432440                                |
| None                                             |
| None                                             |
| 10.1149/1.3432440                                |
| 10.1002/cssc.201000056                           |
| None                                             |
| None                                             |
| 10.1080/08927020902833137                        |
| None                                             |
| None                                             |
| 10.1080/08927020902833137                        |
| 10.1080/08927020902833129                        |
| None                                             |
| None                                             |
| 10.1080/08927020902833129                        |
| None                                             |
| 124710\n10.1063/1.3096964                        |
| None                                             |
| 10.1016/j.susc.2009.01.021                       |
| 10.1016/j.susc.2009.01.021                       |
| None                                             |
| None                                             |
| 246102\n10.1103/PhysRevLett.103.246102           |
| None                                             |
| 205412\n10.1103/PhysRevB.79.205412               |
| None                                             |
| 10.1016/j.jcat.2008.11.020                       |
| None                                             |
| None                                             |
| 10.1016/j.jcat.2008.11.020                       |
| None                                             |
| None                                             |
| 10.1117/12.776303                                |
| None                                             |
| 10.1117/12.776303                                |
| None                                             |
| None                                             |
| None                                             |
| None                                             |
| None                                             |
| None                                             |
| None                                             |
| 10.1039/b608782p                                 |
| 075437\n10.1103/PhysRevB.77.075437               |
| None                                             |
| None                                             |
| None                                             |
| None                                             |
| None                                             |
| 10.1149/1.2358292                                |
| 10.1149/1.2358292                                |
| None                                             |
| 10.1149/1.1856988                                |
| None                                             |
| None                                             |
| 10.1149/1.1856988                                |
| 10.1016/j.cattod.2005.04.008                     |
| None                                             |
| None                                             |
| 10.1016/j.cattod.2005.04.008                     |
| None                                             |
| None                                             |
| None                                             |
| 156801\n10.1103/PhysRevLett.93.156801            |
| 10.1021/jp047349j                                |
| None                                             |
| 10.1021/jp047349j                                |
| None                                             |
| 10.1063/1.1737365                                |
| None                                             |
| None                                             |
| 10.1063/1.1737365                                |
| None                                             |
| 10.1016/j.susc.2003.09.007                       |
| 10.1016/j.susc.2003.09.007                       |
| None                                             |
| None                                             |
| 10.1016/j.susc.2003.08.041                       |
| 10.1016/j.susc.2003.08.041                       |
| None                                             |
| None                                             |
| 10.1016/s0039-6028(02)02679-1                    |
| 10.1016/S0039-6028(02)02679-1                    |
| None                                             |
| 10.1073/pnas.072514399                           |
| None                                             |
| None                                             |
| 10.1073/pnas.072514399                           |
| None                                             |
| 10.1021/jo00117a004                              |
| None                                             |
| None                                             |
| 10.1016/j.pecs.2012.03.003                       |

