_blog/altmetrics-api.html


<div id="outline-container-orgdff2928" class="outline-3">
<h3 id="orgdff2928"><span class="section-number-3">1.4</span> orcid</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">import</span> requests
<span style="color: #0000FF;">import</span> json

<span style="color: #BA36A5;">resp</span> = requests.get(<span style="color: #008000;">"http://pub.orcid.org/0000-0003-2625-9232/orcid-works"</span>,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   headers={<span style="color: #008000;">'Accept'</span>:<span style="color: #008000;">'application/orcid+json'</span>})

<span style="color: #BA36A5;">results</span> = resp.json()

<span style="color: #BA36A5;">DOIS</span> = []
<span style="color: #0000FF;">for</span> i, result <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">enumerate</span>(results[<span style="color: #008000;">'orcid-profile'</span>][<span style="color: #008000;">'orcid-activities'</span>]
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>  [<span style="color: #008000;">'orcid-works'</span>][<span style="color: #008000;">'orcid-work'</span>]):
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #BA36A5;">ext_ids</span> = result[<span style="color: #008000;">'work-external-identifiers'</span>][<span style="color: #008000;">'work-external-identifier'</span>]
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">for</span> eid <span style="color: #0000FF;">in</span> ext_ids:
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">if</span> eid[<span style="color: #008000;">'work-external-identifier-type'</span>] == <span style="color: #008000;">'DOI'</span>:
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #BA36A5;">doi</span> = eid[<span style="color: #008000;">'work-external-identifier-id'</span>][<span style="color: #008000;">'value'</span>]
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">else</span>:
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #BA36A5;">doi</span> = <span style="color: #D0372D;">None</span>

<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #BA36A5;">DOIS</span> += [[doi]]

<span style="color: #0000FF;">return</span> DOIS
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">10.1016/j.susc.2015.10.001</td>
</tr>

<tr>
<td class="org-left">10.1016/j.susc.2015.05.007</td>
</tr>

<tr>
<td class="org-left">10.1063/1.4916823</td>
</tr>

<tr>
<td class="org-left">10.1063/1.4914093</td>
</tr>

<tr>
<td class="org-left">10.1021/jp511426q</td>
</tr>

<tr>
<td class="org-left">10.1063/1.4914093</td>
</tr>

<tr>
<td class="org-left">10.1016/j.susc.2015.02.011</td>
</tr>

<tr>
<td class="org-left">10.1063/1.4914093</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1021/cs501585k</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1016/j.susc.2015.02.011</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1021/jp511426q</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1021/jp508805h</td>
</tr>

<tr>
<td class="org-left">10.1016/j.catcom.2013.10.028</td>
</tr>

<tr>
<td class="org-left">10.1016/j.catcom.2013.10.028</td>
</tr>

<tr>
<td class="org-left">10.1021/ja5015986</td>
</tr>

<tr>
<td class="org-left">10.1021/am4059149</td>
</tr>

<tr>
<td class="org-left">10.1007/s11244-013-0166-3</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1016/j.catcom.2013.10.028</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1039/c3ra47097k</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1039/c3ra47097k</td>
</tr>

<tr>
<td class="org-left">10.1021/jp508805h</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1021/am4059149</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1021/ja5015986</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1021/jp507957n</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1021/jp507957n</td>
</tr>

<tr>
<td class="org-left">10.1007/s11244-013-0166-3</td>
</tr>

<tr>
<td class="org-left">10.1021/ie400582a</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left"><a href="https://doi.org/10.1016/j.molstruc.2013.01.046">https://doi.org/10.1016/j.molstruc.2013.01.046</a></td>
</tr>

<tr>
<td class="org-left">10.1021/ie400582a</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left"><a href="https://doi.org/10.1016/j.ijggc.2013.06.020">https://doi.org/10.1016/j.ijggc.2013.06.020</a></td>
</tr>

<tr>
<td class="org-left">10.1021/ie301419q</td>
</tr>

<tr>
<td class="org-left">10.1021/cs3002644</td>
</tr>

<tr>
<td class="org-left">10.2172/1149701</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1016/j.pecs.2012.03.003</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1111/j.1551-2916.2012.05236.x</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1111/j.1551-2916.2012.05236.x</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1021/cs3002644</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1007/s11244-012-9808-0</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1007/s11244-012-9808-0</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1021/ie300452c</td>
</tr>

<tr>
<td class="org-left">10.1021/ie300452c</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1063/1.4746117</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1063/1.4746117</td>
</tr>

<tr>
<td class="org-left">10.1039/9781849734776-00083</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1039/9781849734776-00083</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1021/ie301419q</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1002/cctc.201000397</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1002/cctc.201000397</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1149/1.3570235</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1021/cs200039t</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1021/cs200039t</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1063/1.3631948</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1063/1.3631948</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1063/1.3561287</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1063/1.3561287</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1002/cssc.201000056</td>
</tr>

<tr>
<td class="org-left">10.1016/j.fuel.2009.11.036</td>
</tr>

<tr>
<td class="org-left">10.1080/08927022.2010.481794</td>
</tr>

<tr>
<td class="org-left">045414\n10.1103/PhysRevB.82.045414</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1016/j.fuel.2009.11.036</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1080/08927022.2010.481794</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1149/1.3432440</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1149/1.3432440</td>
</tr>

<tr>
<td class="org-left">10.1002/cssc.201000056</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1080/08927020902833137</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1080/08927020902833137</td>
</tr>

<tr>
<td class="org-left">10.1080/08927020902833129</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1080/08927020902833129</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">124710\n10.1063/1.3096964</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1016/j.susc.2009.01.021</td>
</tr>

<tr>
<td class="org-left">10.1016/j.susc.2009.01.021</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">246102\n10.1103/PhysRevLett.103.246102</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">205412\n10.1103/PhysRevB.79.205412</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1016/j.jcat.2008.11.020</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1016/j.jcat.2008.11.020</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1117/12.776303</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1117/12.776303</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1039/b608782p</td>
</tr>

<tr>
<td class="org-left">075437\n10.1103/PhysRevB.77.075437</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1149/1.2358292</td>
</tr>

<tr>
<td class="org-left">10.1149/1.2358292</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1149/1.1856988</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1149/1.1856988</td>
</tr>

<tr>
<td class="org-left">10.1016/j.cattod.2005.04.008</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1016/j.cattod.2005.04.008</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">156801\n10.1103/PhysRevLett.93.156801</td>
</tr>

<tr>
<td class="org-left">10.1021/jp047349j</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1021/jp047349j</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1063/1.1737365</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1063/1.1737365</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1016/j.susc.2003.09.007</td>
</tr>

<tr>
<td class="org-left">10.1016/j.susc.2003.09.007</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1016/j.susc.2003.08.041</td>
</tr>

<tr>
<td class="org-left">10.1016/j.susc.2003.08.041</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1016/s0039-6028(02)02679-1</td>
</tr>

<tr>
<td class="org-left">10.1016/S0039-6028(02)02679-1</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1073/pnas.072514399</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1073/pnas.072514399</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1021/jo00117a004</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">10.1016/j.pecs.2012.03.003</td>
</tr>
</tbody>
</table>

<p>
<a href="#api">api</a></p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Kitchin</p>
<p class="date">Created: 2016-12-30 Fri 11:17</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
